
eumso = {'ㅅ': 100, 'ㅆ': 101, 'ㄷ': 110, 'ㄸ': 111, 'ㅌ': 112,
         'ㅈ': 120, 'ㅉ': 121, 'ㅊ': 122, 'ㄱ': 130, 'ㄲ': 131,
         'ㅋ': 132, 'ㅎ': 140, 'ㅇ': 150, 'ㄹ': 160, 'ㅂ': 170,
         'ㅃ': 171, 'ㅍ': 172, 'ㅁ': 180, 'ㄴ': 190 ,
         'ㅣ': 1, 'ㅏ': 2, 'ㅑ': 3, 'ㅓ': 4, 'ㅕ':5,
         'ㅡ': 11, 'ㅜ': 12, 'ㅠ': 13, 'ㅗ': 14, 'ㅛ':15}

multi_eumso = {'ㅄ': ('ㅂ','ㅅ'), 'ㄶ': ('ㄴ','ㅎ'), 'ㄳ': ('ㄱ','ㅅ'),
               'ㄺ': ('ㄹ','ㄱ'), 'ㄼ': ('ㄹ','ㅂ'), 'ㄽ': ('ㄹ','ㅅ'),
               'ㅀ': ('ㄹ','ㅎ'), 'ㄵ': ('ㄴ','ㅈ'), 'ㄾ': ('ㄹ','ㅌ'),
               'ㄿ': ('ㄹ','ㅍ'), 'ㄻ': ('ㄹ','ㅁ')}

eng_to_kor = {'k': ('ㄱ','ㅋ'), 'g': ('ㄱ','ㅈ','ㄲ'), 'n': ('ㄴ', ),
              'd': ('ㄷ', ), 'r': ('ㄹ', ), 'l': ('ㄹ', ),
              'b': ('ㅂ', ), 's': ('ㅅ', ), 'j': ('ㅈ', ),
              'ch': ('ㅊ', ), 't': ('ㅌ', ), 'p': ('ㅍ', ),
              'h': ('ㅎ', ), 'a': ('ㅏ', ), 'e': ('ㅔ', ),
              'c': ('ㅆ', )}

jaeum = ['ㄱ', 'ㄴ', 'ㄷ', 'ㄹ', 'ㅁ',
         'ㅂ', 'ㅅ', 'ㅇ', 'ㅈ', 'ㅊ',
         'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ', 'ㄲ',
         'ㄸ', 'ㅃ', 'ㅆ', 'ㅉ']
moeum = ['ㅏ', 'ㅑ', 'ㅓ', 'ㅕ', 'ㅗ', 'ㅛ', 'ㅜ', 'ㅠ', 'ㅡ', 'ㅣ', 'ㅐ', 'ㅒ', 'ㅔ','ㅖ',
        'ㅚ', 'ㅙ', 'ㅟ', 'ㅞ',  'ㅢ', 'ㅝ', 'ㅘ']

chosung_list = [ 'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ',
        'ㅅ', 'ㅆ', 'ㅇ' , 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

jungsung_list = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ',
        'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ',
        'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ',
        'ㅡ', 'ㅢ', 'ㅣ']

jongsung_list = [
    ' ', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ',
        'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ',
        'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ',
        'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

jaum_list = ['ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄸ', 'ㄹ',
              'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ',
              'ㅃ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

moum_list = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ',
              'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ']
S = 0.0
A = 0.5
B = 1.0
C = 1.5
D = 5.0

'''
S = 0.0
A = 0.1
B = 0.3
C = 0.5
D = 1.0
'''

jaeum_cost = {"ㄱ": [S, D, D, D, D, D, D, B, D, D, A, D, D, A, D, D, D, D, D],
              "ㄴ": [D, S, C, B, D, D, D, D, D, D, D, C, D, D, D, C, D, C, D],
              "ㄷ": [D, B, S, C, D, D, C, D, B, B, D, A, D, D, D, A, D, C, D],
              "ㄹ": [D, C, C, S, D, D, C, D, D, D, D, C, D, D, D, C, D, C, D],
              "ㅁ": [D, D, D, D, S, C, D, D, D, D, D, D, C, D, D, D, C, D, D],
              "ㅂ": [D, D, D, D, B, S, D, D, D, D, D, D, A, D, D, D, A, D, D],
              "ㅅ": [D, C, B, C, D, D, S, D, D, D, D, C, D, D, D, C, D, A, D],
              "ㅇ": [C, D, D, D, D, D, D, S, D, D, C, D, D, C, C, D, D, D, D],
              "ㅈ": [D, D, B, D, D, D, D, D, S, A, D, D, D, B, D, D, D, D, A],
              "ㅊ": [D, D, D, D, D, D, D, D, A, S, D, B, D, D, D, D, D, D, A],
              "ㅋ": [A, D, D, D, D, D, D, C, D, D, S, D, D, B, A, D, D, D, D],
              "ㅌ": [D, C, A, C, D, D, C, D, D, B, D, S, D, B, D, A, D, D, D],
              "ㅍ": [D, D, D, D, C, A, D, D, D, D, D, D, S, B, D, D, A, D, D],
              "ㅎ": [C, D, D, D, D, D, D, C, D, D, B, B, B, S, D, D, D, D, D],
              "ㄲ": [A, D, D, D, D, D, D, C, D, D, A, D, D, C, S, D, D, D, D],
              "ㄸ": [D, C, A, C, D, D, C, D, D, D, D, A, D, D, D, S, D, C, D],
              "ㅃ": [D, D, D, D, C, A, D, D, D, D, D, D, A, D, D, D, S, D, D],
              "ㅆ": [D, C, C, D, D, D, A, D, D, D, D, C, D, D, D, C, D, S, D],
              "ㅉ": [D, D, D, D, D, D, D, D, A, A, D, D, D, D, D, B, D, D, S]}

s = 0.0
b = 0.1
c = 0.5
d = 1

moeum_cost = {"ㅏ": [s, b, c, c, d, d, d, b, d, d, b, d, d, b, d, d, d, d, d, c, c],
              "ㅑ": [c, s, c, c, d, d, d, d, d, d, d, d, d, d, d, c, d, d, d, c, c],
              "ㅓ": [c, c, s, b, d, d, d, d, d, d, d, d, d, d, d, d, d, d, d, c, c],
              "ㅕ": [c, c, c, s, d, d, c, d, d, d, d, d, d, d, d, d, d, d, d, c, c],
              "ㅗ": [d, d, d, d, s, b, c, c, c, d, d, d, d, d, d, d, d, d, d, d, d],
              "ㅛ": [d, d, d, d, c, s, c, c, c, d, d, d, d, d, d, d, d, d, d, d, d],
              "ㅜ": [d, d, d, d, c, c, s, b, c, d, d, d, d, d, d, d, d, d, d, d, d],
              "ㅠ": [d, d, d, d, c, c, c, s, c, d, d, d, d, d, d, d, d, d, d, d, d],
              "ㅡ": [d, d, d, d, c, c, c, c, s, d, d, d, d, d, d, d, d, d, d, d, d],
              "ㅣ": [d, d, d, d, d, d, d, d, d, s, c, c, c, c, d, d, d, d, c, d, d],
              "ㅐ": [d, d, d, d, d, d, d, d, d, c, s, c, c, c, d, d, d, d, c, d, d],
              "ㅒ": [d, d, d, d, d, d, d, d, d, c, c, s, c, c, d, d, d, d, c, d, d],
              "ㅔ": [d, d, d, d, d, d, d, d, d, c, c, c, s, c, d, d, d, d, c, d, d],
              "ㅖ": [d, d, d, d, d, d, d, d, d, c, c, c, c, s, d, d, d, d, c, d, d],
              "ㅚ": [d, d, d, d, d, d, d, d, d, d, d, d, d, d, s, b, c, c, d, d, d],
              "ㅙ": [d, d, d, d, d, d, d, d, d, d, d, d, d, d, b, s, c, b, d, d, d],
              "ㅟ": [d, d, d, d, d, d, d, d, d, d, d, d, b, d, c, c, s, c, d, d, d],
              "ㅞ": [d, d, d, d, d, d, d, d, d, d, d, d, d, d, b, b, c, s, d, d, d],
              "ㅢ": [d, d, d, d, d, d, d, d, d, c, c, c, c, c, d, d, d, d, s, d, d],
              "ㅝ": [c, c, c, c, d, d, d, d, d, d, d, d, d, d, d, d, d, s, d, s, c],
              "ㅘ": [c, c, c, c, d, d, d, d, d, d, d, d, d, d, d, d, d, d, d, c, s]}

moeum_costs = {'ㅏ': 0.2, 'ㅑ': 0.3, 'ㅓ': 1.0, 'ㅕ': 0.9, 'ㅗ': 0.7,
              'ㅛ': 0.8, 'ㅜ': 0.1, 'ㅠ': 0.4, 'ㅡ': 0.6, 'ㅣ': 0.1,
              'ㅔ': 1.1, 'ㅐ': 1.3, 'ㅒ': 1.4, 'ㅖ': 1.2, 'ㅢ': 1.5,
              'ㅟ': 1.6, 'ㅝ': 1.7, 'ㅞ': 1.8, 'ㅙ': 1.9, 'ㅘ': 2.0,
              'ㅚ':2.1}


one_seat_digit = ['영', '일', '이', '삼', '사',
                  '오', '육', '칠', '팔', '구']

ten_digit = ['', '십', '백', '천', '만', '백만', '억']
